trade_exp/src/DataProcessors/ЗагрузкаИзВнешнегоФайла_Альтерра/ЗагрузкаИзВнешнегоФайла_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзВнешнегоФайла_Альтерра</name>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТипа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/DataProcessors/ЗагрузкаИзВнешнегоФайла_Альтерра/Forms/ФормаПроизвольная/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	если не Параметры.Свойство("НастройкиТаблицы") тогда
		СтруктураТаблицы=ЗаполнитьСтандартныеНастройки();
	иначе
		СтруктураТаблицы=Параметры.НастройкиТаблицы;
	конецесли;
	если Параметры.Свойство("ДополнительныйАлгоритм") тогда
		ДополнительныйАлгоритм=Параметры.ДополнительныйАлгоритм;
	конецесли;	
	ТаблицаРезультата=ЗаполнитьТаблицуИзСтруктуры(СтруктураТаблицы);
	
	ЗаполнитьТабличныйДокумент(ТаблицаРезультата); 
	если Параметры.Свойство("ДополнительныеРеквизиты") тогда
		для каждого Реквизит из Параметры.ДополнительныеРеквизиты цикл	   
			ДобавляемыеРеквизиты = Новый Массив;
			МассивСтроки=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Реквизит.Значение,"#");
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Ключ, Новый  ОписаниеТипов(массивСтроки[0])));
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			НовыйЭлемент=Элементы.Добавить(Реквизит.Ключ,Тип("ПолеФормы"),Элементы.ГруппаРеквизитыШапки); 
			НовыйЭлемент.Заголовок =МассивСтроки[1];
			НовыйЭлемент.Ширина =МассивСтроки[2];
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = Реквизит.Ключ;   
			ДополнительныеРеквизиты.Добавить(Реквизит.Ключ);
		конеццикла;
	конецесли;	
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПроверитьИРассчитать(Команда)
	УдалитьЗаполнениеЦветомВерхнейТаблицы("");
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	СопоставитьДанныеТДСНоменклатуройНаСервере();
	Если ТаблицаРезультатаФорма.Количество() > 0 Тогда
		Элементы.ФормаПеренестиИЗакрыть.Видимость = Истина;
		Элементы.ФормаПеренестиИЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция СопоставитьДанныеТДСНоменклатуройНаСервере()
	ТаблицаРезультата=ТаблицаРезультатаФорма.Выгрузить();
	ТаблицаРезультата.Очистить();
	ЦветИспользованныхДанных = Новый Цвет(100,255,0);
	ЦветНеассоциированныхДанных = Новый Цвет(255,200,200);
	ЕстьОшибкиРаспознавания = Ложь;
	
	НомерПоследнейСтроки = КоличествоСтрок;
	НомерСтроки = 1;
	Пока НомерСтроки  <= НомерПоследнейСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		ИмяСтроки = "R" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		ЗначениеОбъекта=Неопределено;
		РаскраситьЯчейки = Ложь;
		ПустаяСтрока="";
		для каждого колонка из ТаблицаРезультата.колонки цикл
			ИмяКолонки= "C"+строка(ТаблицаРезультата.колонки.индекс(колонка)+1);
			ИмяЯчейки=ИмяСтроки+ИмяКолонки;
			ТекстЯчейки= СокрЛП(ТабличныйДокумент.Область(ИмяСтроки + ИмяКолонки).Текст);
			ПустаяСтрока=ПустаяСтрока+ТекстЯчейки;
		конеццикла;	
		если ПустаяСтрока="" тогда
			прервать;
		конецесли;	
		СтрТаблицыРезультата=ТаблицаРезультата.Добавить();
		пустаяячейка=0;
		для каждого колонка из ТаблицаРезультата.колонки цикл
			ИмяКолонки= "C"+строка(ТаблицаРезультата.колонки.индекс(колонка)+1);
			ИмяЯчейки=ИмяСтроки+ИмяКолонки;
			ТекстЯчейки= СокрЛП(ТабличныйДокумент.Область(ИмяСтроки + ИмяКолонки).Текст);
			если ТекстЯчейки="" тогда
				пустаяячейка=пустаяячейка+1;
			конецесли;	
			СтрЯчейки=ВернутьЗначениеЯчейкиТаблицы(ИмяСтроки,имяколонки,колонка);
			если не значениезаполнено(СтрТаблицыРезультата[колонка.имя]) тогда
				ЗначениеОбъекта=Неопределено;
				
				СтрокиПоиска=ТаблицаПоиска.НайтиСтроки(Новый Структура("ПолеЗначения",колонка.Имя));
				если СтрокиПоиска.Количество()>0 и СтрЯчейки<>"" тогда
					СтрокаПоиска=СтрокиПоиска[0];
					если не значениезаполнено(СтрТаблицыРезультата[СтрокаПоиска.ПолеПоиска]) тогда
						СтрокаВычисления=стрзаменить(СтрокаПоиска.АлгоритмПоиска,"&Ячейка&",ТекстЯчейки);
						попытка
							если СтрокаПоиска.ВидАлгоритма=1 тогда
								ЗначениеОбъекта=Вычислить(СтрокаВычисления);
							иначе
								РезультатПоиска="";
								Выполнить(СтрокаВычисления);
								ЗначениеОбъекта=РезультатПоиска;
							конецесли;
						исключение
							ЗначениеОбъекта=НЕОПРЕДЕЛЕНО;
						конецпопытки;	
						если ЗначениеОбъекта<>НЕОПРЕДЕЛЕНО тогда
							СтрТаблицыРезультата[СтрокаПоиска.ПолеПоиска]=ЗначениеОбъекта;
							если значениезаполнено(СтрТаблицыРезультата[СтрокаПоиска.ПолеПоиска]) тогда
								РаскраситьЯчейкуПоиска( ЦветИспользованныхДанных,ИмяЯчейки );
							иначе
								РаскраситьЯчейкуПоиска( ЦветНеассоциированныхДанных,ИмяЯчейки );
							конецесли;
						иначе
							РаскраситьЯчейкуПоиска( ЦветНеассоциированныхДанных,ИмяЯчейки );
						конецесли;	
					конецесли;
				конецесли;
				если не значениезаполнено(СтрТаблицыРезультата[колонка.имя]) тогда
					СтрТаблицыРезультата[колонка.имя]=СтрЯчейки;
				конецесли;
			конецесли;	
	
		конеццикла;	       
		
		если пустаяячейка>=ТаблицаРезультата.колонки.Количество() тогда
			ТаблицаРезультата.Удалить(СтрТаблицыРезультата);
			для каждого колонка из ТаблицаРезультата.колонки цикл
				ИмяКолонки= "C"+строка(ТаблицаРезультата.колонки.индекс(колонка)+1);
				ИмяЯчейки=ИмяСтроки+ИмяКолонки;
				//	РаскраситьЯчейкуПоиска( ЦветНеассоциированныхДанных,ИмяЯчейки );
			КонецЦикла;
			прервать;
		конецесли;	
			для каждого Реквизит из ДополнительныеРеквизиты цикл	   
				
				СтрТаблицыРезультата[Реквизит.значение]=ЭтаФорма[Реквизит.значение];
			конеццикла;	

	КонецЦикла;
	ЗначениеВРеквизитФормы(ТаблицаРезультата, "ТаблицаРезультатаФорма");

	Возврат ЕстьОшибкиРаспознавания;	
КонецФункции

&НаСервере
Функция СохранитьВХранилище()
	 возврат ПоместитьВоВременноеХранилище(ТаблицаРезультатаФорма.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ПеренестиИЗакрыть(Команда)   
	если ОбработанДополнительныйАлгоритм() тогда
	Закрыть(СохранитьВХранилище());             
	конецесли;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ОбработанДополнительныйАлгоритм()
	если ДополнительныйАлгоритм="" тогда
		возврат истина;
	конецесли;	
	если ДополнительныйАлгоритм="ПроверкаРозничнойНаценкиЦеноваяГруппа" или ДополнительныйАлгоритм="ПроверкаРозничнойНаценкиНоменклатура" тогда 
		ОписаниеОшибки="";
		если ДополнительныйАлгоритм="ПроверкаРозничнойНаценкиЦеноваяГруппа" тогда
		ШаблонОшибки=НСтр("ru = 'По ценовой группе %1 внесено некорректное значение процента наценки'");
		иначеесли ДополнительныйАлгоритм="ПроверкаРозничнойНаценкиНоменклатура" тогда
		ШаблонОшибки=НСтр("ru = 'По номенклатуре %1 внесено некорректное значение процента наценки'");	
		конецесли;
		
		для каждого стр из ТаблицаРезультатаФорма цикл
			если стр.ПроцентНаценки<=0 тогда
				ОписаниеОшибки=ОписаниеОшибки+СтрШаблон(ШаблонОшибки,стр.ЦеноваяГруппа_Номенклатура);
			конецесли;	
		конеццикла;	  
		если ОписаниеОшибки<>"" тогда
			ОписаниеОшибки=ОписаниеОшибки+", что недопустимо";
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			возврат ложь;
		иначе
			возврат истина;
		конецесли;
		
	конецесли;	

КонецФункции // ()

&НаСервере
Функция ВернутьЗначениеЯчейки(ИмяСтроки, ИмяКолонки)
	Если ЗначениеЗаполнено(ИмяКолонки) Тогда
		Возврат СокрЛП(ТабличныйДокумент.Область(ИмяСтроки + ИмяКолонки).Текст);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Функция ВернутьЗначениеЯчейкиТаблицы(ИмяСтроки,ИмяКолонки, Колонка)
	ТекстЯчейки= СокрЛП(ТабличныйДокумент.Область(ИмяСтроки + ИмяКолонки).Текст);
	попытка
		МассивТипов=Новый Массив();
		МассивТипов.Добавить(Тип("Дата"));
		если Колонка.ТипЗначения=Новый ОписаниеТипов(МассивТипов)  тогда
			возврат ОбщегоНазначенияКлиентСервер.СтрокаВДату(ТекстЯчейки);
		иначе	
			возврат Колонка.ТипЗначения.привестиЗначение(ТекстЯчейки);
		конецесли;
	исключение
		Возврат "";
	конецпопытки;
КонецФункции

&НаСервере
Процедура РаскраситьЯчейкуПоиска( Цвет, Ячейка)
	ТабличныйДокумент.Область(Ячейка+":" +Ячейка).ЦветФона = Цвет;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокумент(ТаблицаРезультата)
	ТабличныйДокумент.Очистить();
	Макет=Обработки.ЗагрузкаИзВнешнегоФайла_Альтерра.ПолучитьМакет("МакетПроизвольный");
	Область=Макет.ПолучитьОбласть("Таблица");
	КоличествоКолонок=ТаблицаРезультата.Колонки.Количество();
	для каждого Колонка из ТаблицаРезультата.Колонки цикл
		Область.Параметры.РеквизитТаблицы=Колонка.Заголовок;
		Область.Области.Таблица.ШиринаКолонки=Колонка.Ширина;
		ТабличныйДокумент.Присоединить(Область);
	конеццикла;	

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтандартныеНастройки()
	СтруктураНастройки=Новый Структура();
	//ключ - имя поля таблицы;
	// значение - массив показателей:
	// 1-тип колонки,2- наименование колонки,ширина колонки
	// показатели поиска (необязательные)
	// 4- вид алгоритма поиска (1- по функции "Вычислить", 2- по функции "Выполнить" с возвратом значения "РезультатПоиска"
	// 5- поле поиска

	СтруктураНастройки.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураНастройки.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураНастройки.Вставить("Количество","число#Количество#15");
	СтруктураНастройки.Вставить("Цена","число#Цена#10");
	СтруктураНастройки.Вставить("Сумма","число#Сумма#10");
	Возврат  СтруктураНастройки;
Конецфункции
&НаКлиенте
Процедура УдалитьЗаполнениеЦветомВерхнейТаблицы(Команда)
	ТабличныйДокумент.Область(ПолучитьИмяОбластиИзНастроек()).ЦветФона = Новый Цвет();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяОбластиИзНастроек()
	Ширина=КоличествоКолонок;
	СтрокаКонтроля="_";
	Длина=1;
	пока СтрокаКонтроля<>"" цикл
		СтрокаКонтроля="";	
		для к=1 по Ширина цикл
			СтрокаКонтроля=СтрокаКонтроля+ВернутьЗначениеЯчейки("R"+Длина,"C"+к);
		конеццикла;
		если строкаконтроля="" тогда
			КоличествоСтрок=длина;
			прервать;
		конецесли;	
		длина=длина+1;
	конеццикла;
	
	Область="R2C1:R"+Длина+1+"С"+Ширина;
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуИзСтруктуры(СтруктураТаблицы)
	ТаблицаФормы = РеквизитФормыВЗначение("ТаблицаРезультатаФорма");
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	ТаблицаРезультата=Новый ТаблицаЗначений();  
	для каждого СтрокаНастройки из СтруктураТаблицы цикл
		МассивСтроки=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаНастройки.Значение,"#");
		МассивТипов=Новый Массив();
		МассивТипов.Добавить(тип(МассивСтроки[0]));
		ОписаниеТиповКолонки=Новый ОписаниеТипов(МассивТипов);
		ЗаголовокКолонки= МассивСтроки[1];
		Ширина=	МассивСтроки[2];	
		ТаблицаРезультата.Колонки.Добавить(СтрокаНастройки.Ключ,ОписаниеТиповКолонки,ЗаголовокКолонки,Ширина);
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(СтрокаНастройки.Ключ, ОписаниеТиповКолонки, "ТаблицаРезультатаФорма"));
		// формирование поиска
		если МассивСтроки.Количество()>3 тогда
			СтрПоиска=ТаблицаПоиска.Добавить();
			СтрПоиска.ПолеЗначения=СтрокаНастройки.Ключ;
			СтрПоиска.ВидАлгоритма= число(МассивСтроки[3]);
			СтрПоиска.АлгоритмПоиска=МассивСтроки[4];
			СтрПоиска.ПолеПоиска=МассивСтроки[5];
		Конецесли;
	конеццикла;	   
	если Параметры.Свойство("ДополнительныеРеквизиты") тогда    
		для каждого Реквизит из Параметры.ДополнительныеРеквизиты цикл	   
			МассивСтроки=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Реквизит.Значение,"#");
			ТаблицаРезультата.Колонки.Добавить(Реквизит.Ключ,Новый ОписаниеТипов(массивСтроки[0]),массивСтроки[1]);
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Ключ, Новый ОписаниеТипов(массивСтроки[0]), "ТаблицаРезультатаФорма"));
		конеццикла;
	конецесли;	

	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	ЗначениеВРеквизитФормы(ТаблицаРезультата, "ТаблицаРезультатаФорма");
	возврат ТаблицаРезультата;
Конецфункции


#КонецОбласти
